{"keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"config": {"embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05, "dtype": "float32"}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "embeddings_regularizer": null, "output_dim": 100, "activity_regularizer": null, "name": "embedding", "batch_input_shape": [null, 1000], "input_dim": 20000, "input_length": 1000, "mask_zero": false, "dtype": "float32", "trainable": false}, "class_name": "Embedding"}, {"config": {"filters": 128, "kernel_size": [5], "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv1d", "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1], "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"strides": [5], "padding": "valid", "name": "max_pooling1d", "pool_size": [5], "dtype": "float32", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"rate": 0.2, "name": "dropout", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"filters": 128, "kernel_size": [5], "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv1d_1", "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1], "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"strides": [5], "padding": "valid", "name": "max_pooling1d_1", "pool_size": [5], "dtype": "float32", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"rate": 0.2, "name": "dropout_1", "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"filters": 128, "kernel_size": [5], "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv1d_2", "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1], "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"strides": [35], "padding": "valid", "name": "max_pooling1d_2", "pool_size": [35], "dtype": "float32", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "dtype": "float32", "kernel_constraint": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "dtype": "float32", "kernel_constraint": null, "units": 5, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential"}